---
kind: method
id: M:Autodesk.Revit.DB.FaceArray.Append(Autodesk.Revit.DB.Face)
source: html/6c279fdf-713f-31db-3981-5ca146fea0f0.htm
---
# Autodesk.Revit.DB.FaceArray.Append Method

Add the face to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	Face item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Face`) - The face to be added.